skarlsso/PIC/src/dsPIC33/main_rc_transmitter_slave.c
// Code to drive a RC Quadcopter, Helicopter, or Car, with a Wii Nunchuk.
//
// The micontroller is connected to a Spektrum DX8 via a trainer cable and
// outputs a PPM signal, just like a DX6i does in the Slave mode. The DX8
// reads the PPM signal and passes it along to the RC device. The 2.4 GHz
// communication with the RC receiver is entierly handled by the DX8.
//
//
// The PPM Signal:
//
// The format of signal timing was found by probing the output of a DX6i with an
// oscilloscope.
//
// Every 22 ms a PPM signal is sent. There's one fixed-length pulse (400us) per
// RC transmitter channel, pluse one to mark the end of the penultimate channel.
// The value of a channel is the duration between the start of its pulse and the
// start of the next channels pulse. By varying the length of the duration
// between two channels, different values can be sent to the receiver.
//
// The duration between two pulses was between min: 1000 us and max: 2000 us, on
// the DX6i with 100% travel. I haven't measured what 125% gives.
//
// PPM voltage levels: no pulse is 3.3V and pulses are 0V. The DX6i seems to use
// a pull-down resistor. I measured the reistance between GND and PPM to be 6K.
//
//
// Nintendo Wii Nunchuk:
//
// After each PPM pulse, the microcontroller uses I2C to read the state of the
// Nunchuk. Both the joystick and the accelerometer are used to drive RC
// channels. The buttons are used to turn on the PPM output and to turn on the
// status indicator.
//
//
// Status Indicator:
//
// The status indicator is a WS2812B RGB LED strip with 16 LEDs. It shows the
// on/off state of the PPM output and the current values of the Nunchuk. The
// WS2812B controll sequence are sent after polling the Nunchuk.



// DSPIC33FJ128GP802 Configuration Bit Settings

#include <xc.h>

// FBS
#pragma config BWRP = WRPROTECT_OFF     // Boot Segment Write Protect (Boot Segment may be written)
#pragma config BSS = NO_FLASH           // Boot Segment Program Flash Code Protection (No Boot program Flash segment)
#pragma config RBS = NO_RAM             // Boot Segment RAM Protection (No Boot RAM)

// FSS
#pragma config SWRP = WRPROTECT_OFF     // Secure Segment Program Write Protect (Secure segment may be written)
#pragma config SSS = NO_FLASH           // Secure Segment Program Flash Code Protection (No Secure Segment)
#pragma config RSS = NO_RAM             // Secure Segment Data RAM Protection (No Secure RAM)

// FGS
#pragma config GWRP = OFF               // General Code Segment Write Protect (User program memory is not write-protected)
#pragma config GSS = OFF                // General Segment Code Protection (User program memory is not code-protected)

// FOSCSEL
#pragma config FNOSC = FRCPLL           // Oscillator Mode (Internal Fast RC (FRC) w/ PLL)
#pragma config IESO = ON                // Internal External Switch Over Mode (Start-up device with FRC, then automatically switch to user-selected oscillator source when ready)

// FOSC
#pragma config POSCMD = NONE            // Primary Oscillator Source (Primary Oscillator Disabled)
#pragma config OSCIOFNC = OFF           // OSC2 Pin Function (OSC2 pin has clock out function)
#pragma config IOL1WAY = ON             // Peripheral Pin Select Configuration (Allow Only One Re-configuration)
#pragma config FCKSM = CSDCMD           // Clock Switching and Monitor (Both Clock Switching and Fail-Safe Clock Monitor are disabled)

// FWDT
#pragma config WDTPOST = PS2048            // Watchdog Timer Postscaler (1:8)
//#pragma config WDTPOST = PS32768            // Watchdog Timer Postscaler (1:8)
#pragma config WDTPRE = PR128           // WDT Prescaler (1:128)
#pragma config WINDIS = OFF             // Watchdog Timer Window (Watchdog Timer in Non-Window mode)
#pragma config FWDTEN = OFF              // Watchdog Timer Enable (Watchdog timer always enabled)

// FPOR
#pragma config FPWRT = PWR128           // POR Timer Value (128ms)
#pragma config ALTI2C = OFF             // Alternate I2C  pins (I2C mapped to SDA1/SCL1 pins)

// FICD
#pragma config ICS = PGD1               // Comm Channel Select (Communicate on PGC1/EMUC1 and PGD1/EMUD1)
#pragma config JTAGEN = OFF             // JTAG Port Enable (JTAG is Disabled)


// Hard-coded Fcy. See calculation below.
#define FCY 29840000

#include "time/delayer.h"

#define PPM_OUTPUT     LATAbits.LATA2
#define WS2812B_OUTPUT LATAbits.LATA4
#define ERROR_OUTPUT   LATBbits.LATB4

#include "debug/led_debug.h"

#define I2C_ERROR(message) pulse_forever2(ERROR_OUTPUT, 200, 200, 1)

#include "communication/i2c_helper.h"
#include "peripherals/controller/wii_nunchuk.h"
#include "peripherals/led/ws2812b.h"

// The PPM output is on IFF this is set to 1.
static volatile int is_ppm_output_on = 0;

// Setup the frequency.
static void init_clock_frequency(void) {
    // Timing for Internal FRC /w PPL

    // Fin     : 7370000
    //  Fin    : FRC / FRCDIV
    //  FRC    : 7370000 // Internal Fast RC Oscillator: 7.37 MHz
    //  FRCDIV : 1       // Internal Fast RC Oscillator Postscaler bits
    //   Default: CLKDIV.FRCDIV = 1;

    // PPL calculation
    //  VCOin  :    Fin / N1 must be within 0.8 MHz and 8 MHz
    //  VCOout :  VCOin * M  must be within 100 MHz and 200 MHz
    //  Fosc   : VCOout / N2 must be within 12.5 MHz and 80 MHz
    // Final frequency
    //  Fcy    : Fosc / 2

    // N1 : 2
    //  Default: CLKDIVbits.PLLPRE = 0;

    // M : 64 (default: 50)
    PLLFBDbits.PLLDIV = 64; // Set to 64 to match Fcy of dsPIC32f2011 FRC /w 16 PLL

    // N2 : 4
    //  Default: CLKDIVbits.PLLPOST = 1;

    // Fcy = Fin / N1 * M / N2 / 2
    // Fcy = 737000 / 2 * 64 / 4 / 2
    // Fcy = 29840000

    // Processor Clock Reduction Select Bits
    //  Default: CLKDIV.DOZE = 0x3; // Fcy/8
}


static void init_pins() {
    AD1PCFGL = 0xFFFF;

    // Setup pins for the PPM output signal.
    LATA = 0;
    LATB = 0;
    TRISA = 0;
    TRISB = 0;

    // The PPM is normally high.
    LATAbits.LATA2   = 1;
    TRISAbits.TRISA2 = 0; // Output

    // WS2812B
    LATAbits.LATA4   = 0;
    TRISAbits.TRISA4 = 0; // Output

    // Error led
    LATBbits.LATB4   = 0;
    TRISBbits.TRISB4 = 0; // Output
}

// TODO: Tune times. Not really 22 ms.
//       Use external oscillator?

// Times derived from 22 ms == 0xA4000 = 671744 in TMR
// Low pulse duration
#define TMR_400us 0x2FB5
#define TMR_600us 0x478F
// Should be 1000us, but 1024 makes it easier to
// convert the 10 bit channel value to a TMR duration.
#define TMR_1024us 0x7763

// Value is 10 bit.
static int channel_value_to_TMR(unsigned int value) {
    // The 10 bit value represent a value within [0, 1024) us.
    // Take care to not lose precision when ´
    return TMR_600us + ((value * (unsigned long) TMR_1024us) >> 10);
}

#define num_channels 6

typedef struct {
    unsigned int value    : 10; // 10 bits per channel.
    unsigned int inverted :  1;
} Channel;


// The last channel is a dummy channel to mark the end of the channel 6 pulse.
static Channel channels[num_channels + 1];

#define INIT_STATE             0
#define channel_START_STATE    1
#define channel_DURATION_STATE 2

//static channel* current_channel = &channels[0];
static volatile int current_channel_i = 0;

// Spektrum DX8, DX6i etc. stick+movement to channel index
#define LEFT_X_CHANNEL   3
#define LEFT_Y_CHANNEL   0
#define RIGHT_X_CHANNEL  1
#define RIGHT_Y_CHANNEL  2
#define UNDEF_CHANNEL_4  4
#define UNDEF_CHANNEL_5  5
// Stop sentinel
#define STOP_CHANNEL     6

#define NUNCHUK_TO_CHANNEL_SETUP 1

#if (NUNCHUK_TO_CHANNEL_SETUP == 0)
#define ACCELEROMETER_X_CHANNEL  RIGHT_X_CHANNEL
#define ACCELEROMETER_Y_CHANNEL  RIGHT_Y_CHANNEL
#define JOYSTICK_X_CHANNEL       LEFT_X_CHANNEL
#define JOYSTICK_Y_CHANNEL       LEFT_Y_CHANNEL
#elif (NUNCHUK_TO_CHANNEL_SETUP == 1)
#define ACCELEROMETER_X_CHANNEL  LEFT_X_CHANNEL
#define ACCELEROMETER_Y_CHANNEL  LEFT_Y_CHANNEL
#define JOYSTICK_X_CHANNEL       RIGHT_X_CHANNEL
#define JOYSTICK_Y_CHANNEL       RIGHT_Y_CHANNEL
#endif

#define RC_DEVICE_QUADCOPTER    0
#define RC_DEVICE_CP_HELICOPTER 1
#define RC_DEVICE_CAR           2

#define QUADCOPTER_CHANNEL_THROTTLE     JOYSTICK_Y_CHANNEL
#define QUADCOPTER_CHANNEL_RUDDER       JOYSTICK_X_CHANNEL
#define QUADCOPTER_CHANNEL_AILERON      ACCELEROMETER_X_CHANNEL
#define QUADCOPTER_CHANNEL_ELEVATOR     ACCELEROMETER_Y_CHANNEL

#define CP_HELICOPTER_CHANNEL_THROTTLE  JOYSTICK_Y_CHANNEL
#define CP_HELICOPTER_CHANNEL_RUDDER    JOYSTICK_X_CHANNEL
#define CP_HELICOPTER_CHANNEL_AILERON   ACCELEROMETER_X_CHANNEL
#define CP_HELICOPTER_CHANNEL_ELEVATOR  ACCELEROMETER_Y_CHANNEL

#define CAR_CHANNEL_THROTTLE            JOYSTICK_Y_CHANNEL
#define CAR_CHANNEL_STEARING            ACCELEROMETER_X_CHANNEL

int rc_device = RC_DEVICE_QUADCOPTER;

static void init_channels() {
    // Init channels to neutral.
    int i;
    for (i = 0; i < num_channels; i++) {
        channels[i].value    = 511;
        channels[i].inverted =   0;
    }

    // Set overrides for specific RC devices.
    switch (rc_device) {
        case RC_DEVICE_QUADCOPTER:
            channels[QUADCOPTER_CHANNEL_THROTTLE].value = 0;

            channels[QUADCOPTER_CHANNEL_RUDDER  ].inverted = 1;
            channels[QUADCOPTER_CHANNEL_AILERON ].inverted = 1;
            channels[QUADCOPTER_CHANNEL_ELEVATOR].inverted = 1;
            break;
        case RC_DEVICE_CP_HELICOPTER:
            // Start with throttle at neutral.
            break;
        case RC_DEVICE_CAR:
            channels[CAR_CHANNEL_THROTTLE].value = 0;
            break;
        default:
            break;
    }
}


static void init_timers() {
    // 22 ms timer.
    // 32 bit timer [Timer3, Timer2]
    T2CONbits.TON   = 0; // Disable timer
    T2CONbits.TCS   = 0; // Internal Tosc/2
    T2CONbits.TGATE = 0;
    T2CONbits.TCKPS = 0; // Prescaler
    T2CONbits.T32   = 1;
    TMR3            = 0;
    TMR2            = 0;
    // Hand-tuned to get a period of 22 ms.
    PR3             = 0xA;
    PR2             = 0x4000;
    // Setup interrupts.
    IPC2bits.T3IP   = 0x01;
    IFS0bits.T3IF   = 0;
    IEC0bits.T3IE   = 1;

    // PPM pulse train timer.
    T4CONbits.TON   = 0; // Disable timer
    T4CONbits.TCS   = 0; // Internal Tosc/2
    T4CONbits.TGATE = 0;
    T4CONbits.TCKPS = 0; // Prescaler
    T4CONbits.T32   = 0;
    TMR4            = 0;
    // PR4 set during pulse train.
    IPC6bits.T4IP   = 0x01;
    IFS1bits.T4IF   = 0;
    IEC1bits.T4IE   = 1;

    T2CONbits.TON = 1;
}


// === Status Indicator using 16 WS2812B RGB LEDs ===

static const RGB red     = {0x10,    0,    0};
static const RGB green   = {0,    0x10,    0};
static const RGB blue    = {0,       0, 0x10};
static const RGB rgb_off = {0,       0,    0};
static const RGB white   = {0x10, 0x10, 0x10};

static RGB ppm_status_color = {0, 0, 0};

#define STATUS_INDICATOR_NUM_LEDS 16
static RGB status_indicator[STATUS_INDICATOR_NUM_LEDS];

// Output the status to the LEDs.
static void status_indicator_update() {
    // Only support for a 16-LED strip.
#if (STATUS_INDICATOR_NUM_LEDS == 16)
    ws2812b_send_RGB16(WS2812B_OUTPUT, status_indicator);
#else
#   error "Not implemented"
#endif
}

// Register a new value at the index.
// Return true iff this changed the RGB value for the given index.
static int status_indicator_register_value(unsigned int index, RGB rgb) {
    if (!RGB_equals(status_indicator[index], rgb)) {
        status_indicator[index] = rgb;
        return 1;
    }
    return 0;
}

static int status_indicator_register_ppm_on(unsigned int index0, unsigned int index1) {
#define PPM_STATUS_BLINK 1

    if (PPM_STATUS_BLINK) {
        if (is_ppm_output_on) {
            if (ppm_status_color.r != 0) {
                ppm_status_color.r = 0;
                ppm_status_color.g = 0;
            } else {
                ppm_status_color.g++;
                ppm_status_color.g &= 0xF;
            }
        } else {
            if (ppm_status_color.g != 0) {
                ppm_status_color.g = 0;
                ppm_status_color.r = 0;
            } else {
                ppm_status_color.r++;
                ppm_status_color.r &= 0xF;
            }
        }
    } else {
        ppm_status_color = is_ppm_output_on ? green : red;
    }

    int changed = 0;
    changed |= status_indicator_register_value(index0, ppm_status_color);
    changed |= status_indicator_register_value(index1, ppm_status_color);

    return changed;
}

// Convert the ratio of value and (max - min) into a number of lit LEDs.
static void status_indicator_show_value(RGB color, unsigned int value, unsigned int min, unsigned int max) {
    LED_ASSERT(value >= min, ERROR_OUTPUT, 1000, 5000);
    LED_ASSERT(value <= max, ERROR_OUTPUT, 5000, 1000);

    // Did any of the values change?
    int changed = 0;

    // Use the two outermost leds for PPM status
    changed |= status_indicator_register_ppm_on(0, STATUS_INDICATOR_NUM_LEDS - 1);

    // The rest of the LEDs are used to represent the 'value'.
    unsigned int start_value_led = 1;
    unsigned int num_value_leds = STATUS_INDICATOR_NUM_LEDS - 2;

    // Figure out how many LEDs to lit depending on the ratio of value and span.
    unsigned int step = (max - min) / num_value_leds + 1;

    // Bias against min.
    value -= min;

    // Make sure value == 0 => all LEDs off.
    unsigned int num_on_value_leds = (value + (step - 1)) / step;

    LED_ASSERT(num_on_value_leds <= num_value_leds, ERROR_OUTPUT, 2000, 1000);


    unsigned int i = start_value_led;

    // Turn on LEDs.
    for (; i < start_value_led + num_on_value_leds; i++) {
        changed |= status_indicator_register_value(i, color);
    }

    // Turn off LEDs.
    for (; i < start_value_led + num_value_leds; i++) {
        changed |= status_indicator_register_value(i, rgb_off);
    }

    // Only update the status indicator if needed.
    if (changed) {
        status_indicator_update();
    }    
}

static void status_indicator_show_ppm_only() {
    status_indicator_show_value(rgb_off, 0, 0, 255);
}

#define STATUS_INDICATOR_NONE            0
#define STATUS_INDICATOR_ACCELEROMETER_X 1
#define STATUS_INDICATOR_ACCELEROMETER_Y 2
#define STATUS_INDICATOR_JOYSTICK_X      3
#define STATUS_INDICATOR_JOYSTICK_Y      4

static int current_status_indicator = STATUS_INDICATOR_NONE;

static void switch_status_indicator() {
    current_status_indicator++;
    switch (current_status_indicator) {
        case STATUS_INDICATOR_NONE:
        case STATUS_INDICATOR_ACCELEROMETER_X:
        case STATUS_INDICATOR_ACCELEROMETER_Y:
        case STATUS_INDICATOR_JOYSTICK_X:
        case STATUS_INDICATOR_JOYSTICK_Y:
            // Keep state.
            break;
        default:
            // Wrap around.
            current_status_indicator = STATUS_INDICATOR_NONE;
            break;
    }
}

static void show_current_status(Nunchuk* nunchuk) {
    switch (current_status_indicator) {
        case STATUS_INDICATOR_ACCELEROMETER_X:
            status_indicator_show_value(blue,
                    nunchuk->accelerometer.x,
                    nunchuk_requested_min()->accelerometer.x,
                    nunchuk_requested_max()->accelerometer.x);
            break;
        case STATUS_INDICATOR_ACCELEROMETER_Y:
            status_indicator_show_value(green,
                    nunchuk->accelerometer.y,
                    nunchuk_requested_min()->accelerometer.y,
                    nunchuk_requested_max()->accelerometer.y);
            break;
        case STATUS_INDICATOR_JOYSTICK_X:
            status_indicator_show_value(red,
                    nunchuk->joystick.x,
                    nunchuk_requested_min()->joystick.x,
                    nunchuk_requested_max()->joystick.x);
           break;
        case STATUS_INDICATOR_JOYSTICK_Y:
            status_indicator_show_value(white,
                    nunchuk->joystick.y,
                    nunchuk_requested_min()->joystick.y,
                    nunchuk_requested_max()->joystick.y);
            break;
        case STATUS_INDICATOR_NONE:
        default:
            status_indicator_show_ppm_only();
            break;
    }
}

static void switch_ppm_on_state() {
    is_ppm_output_on = !is_ppm_output_on;
}

static unsigned int  c_button_on_count = 0;
static unsigned int  z_button_on_count = 0;

#define BUTTON_PRESSED_COUNT_BEFORE_REGISTERED 4

static int is_button_c_pressed(Nunchuk* nunchuk) {
    if (nunchuk->buttons.c) {
        c_button_on_count++;
        if (c_button_on_count == BUTTON_PRESSED_COUNT_BEFORE_REGISTERED) {
            return 1;
        }
    } else {
        c_button_on_count = 0;
    }

    return 0;
}

static int is_button_z_pressed(Nunchuk* nunchuk) {
    if (nunchuk->buttons.z) {
        z_button_on_count++;
        if (z_button_on_count == BUTTON_PRESSED_COUNT_BEFORE_REGISTERED) {
            return 1;
        }
    } else {
        z_button_on_count = 0;
    }

    return 0;
}

#define SET_CHANNEL_VALUE(CHANNEL, VALUE) \
    channels[CHANNEL].value = (channels[CHANNEL].inverted ? (1023 - (VALUE)) : (VALUE))

static void respond_to_nunchuk(Nunchuk* nunchuk) {
    if (is_button_c_pressed(nunchuk)) {
        switch_ppm_on_state();
    }

    if (is_button_z_pressed(nunchuk)) {
       switch_status_indicator();
    }

    if (nunchuk_uses_adaptive_limits()) {
        nunchuk_adapt_limits(nunchuk);
    }

    // Cap the nunchuk values to the current limit strategy.
    Nunchuk limited_nunchuk = nunchuk_create_limited(nunchuk);

    // Scale the values to full bit-resolution.
    Nunchuk scaled_nunchuk  = nunchuk_create_scaled(&limited_nunchuk);

    // 8 bits -> 10 bits
    SET_CHANNEL_VALUE(JOYSTICK_X_CHANNEL, scaled_nunchuk.joystick.x << 2);
    SET_CHANNEL_VALUE(JOYSTICK_Y_CHANNEL, scaled_nunchuk.joystick.y << 2);
    // 10 bits -> 10 bits
    SET_CHANNEL_VALUE(ACCELEROMETER_X_CHANNEL, scaled_nunchuk.accelerometer.x);
    SET_CHANNEL_VALUE(ACCELEROMETER_Y_CHANNEL, scaled_nunchuk.accelerometer.y);

    // Show the limited Nunchuk values and not the channel values.
    show_current_status(&limited_nunchuk);
}

static void check_reset_condition() {
    int watchdog_timedout = RCONbits.WDTO;
    int trap_reset        = RCONbits.TRAPR;
    int illegal_op        = RCONbits.IOPUWR;
    int brown_out         = 0; // Ignore BOR for now.

    // Clear
    RCON = 0;

    int pulse_length = 0
        + watchdog_timedout * 500
        + trap_reset        * 1000
        + illegal_op        * 2000
        + brown_out         * 4000;

    if (pulse_length > 0) {
        // Failsafe. Drive the PPM output high, to stop sending data.
        PPM_OUTPUT = 1;

        // Notify and wait for a manual reset.
        pulse_forever2(ERROR_OUTPUT, pulse_length, 1000, 1 /* ClrWtd() */);
    }
}

static volatile int poll_nunchuk = 0;

int main(void) {
    // Setup clock frequency.
    init_clock_frequency();

    // BOR problems. Let the device reset a couple of times.
    delay_ms(1000);

    init_pins();

    // Check for reset conditions and react accordingly.
    check_reset_condition();

    // Init LEDs for the status indicator.
    init_ws2812b(WS2812B_OUTPUT);

    // Initialize the channel values with safe start values.
    init_channels();

    // Setup 100MHz I2C communication with the Nunchuk.
    init_i2c(270, TRISBbits.TRISB8, TRISBbits.TRISB9, LATBbits.LATB9);
    
    // Init the Wii Nunchuk.
    static unsigned char nunchuk_bytes[NUNCHUK_READ_BYTES];
    init_nunchuk(nunchuk_bytes);

    // Init timers last, since this will start running code in ISRs.
    init_timers();

    status_indicator_show_ppm_only();

    while (1) {
        ClrWdt();
        if (poll_nunchuk) {
            Nunchuk nunchuk = read_data_from_nunchuk(nunchuk_bytes);
            respond_to_nunchuk(&nunchuk);
            poll_nunchuk = 0;
        }
    }

    return 0;
}

volatile int ppm_state = INIT_STATE;

static int ppm_state_transition() {
    // State machine for channel pulse train.

    // Every channel pulse starts with low for 400us and then a high
    // somewhere between 600us and 1600us depending on the channel value.

    switch (ppm_state) {
        case INIT_STATE:
            ppm_state = channel_START_STATE;

            PPM_OUTPUT = 0;
            PR4 = TMR_400us;

            // Initiate the pulse train timer.
            T4CONbits.TON = 1;
            break;

        case channel_START_STATE:
            ppm_state = channel_DURATION_STATE;

            PPM_OUTPUT = 1;
            PR4 = channel_value_to_TMR(channels[current_channel_i].value);
            break;

        case channel_DURATION_STATE:
            current_channel_i++;
            if (current_channel_i != num_channels + 1) {
                // More channels to handle.
                ppm_state = channel_START_STATE;

                PPM_OUTPUT = 0;
                PR4 = TMR_400us;
            } else {
                // Done with all channels.
                ppm_state = INIT_STATE;
                current_channel_i = 0;

                // Rest the pulse train timer.
                T4CONbits.TON = 0;
                TMR4 = 0;

                return 1; // Done
            }
            break;

        default: // Error
            pulse_forever2(ERROR_OUTPUT, 1000, 4000, 1);
            break;
    };

    return 0; // More PPM state transitions.
}

// Timer3 ISR - 22 ms
void __attribute__((__interrupt__, no_auto_psv)) _T3Interrupt(void) {
    if (is_ppm_output_on) {
        // Start the PPM pulse train.
        ppm_state_transition();
    } else {
        poll_nunchuk = 1;
    }

    IFS0bits.T3IF = 0; // Clear Timer3 Interrupt Flag
}

// Timer4 ISR - pulse-train-channel-state dependent length.
void __attribute__((__interrupt__, no_auto_psv)) _T4Interrupt(void) {
    // Continue with the next step in the PPM pulse train.
    int last_transition = ppm_state_transition();
    if (last_transition) {
        poll_nunchuk = 1;
    }

    IFS1bits.T4IF = 0; // Clear Timer4 Interrupt Flag
}
